apps/baukis2/app/controllers/admin/sessions_controller.rb

SELECT "admini_strators".* FROM "admini_strators" WHERE (LOWER(email) = 'admin1@example.com') LIMIT $1  [["LIMIT", 1]]
---
  def create
    @form = Admin::LoginForm.new(login_form_params)
    if @form.email.present?
      administrator =
        AdminiStrator.find_by('LOWER(email) = ?', @form.email.downcase)