apps/baukis2/app/controllers/staff/customers_controller.rb

  def index
    @customers = Customer.order(:family_name_kana, :given_name_kana)
                         .page(params[:page])
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."family_name_kana" ASC, "customers"."given_name_kana" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "customers"

  def edit
    @customer_form = Staff::CustomerForm.new(Customer.find(params[:id]))
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @customer_form = Staff::CustomerForm.new
    @customer_form.assign_attributes(params[:form])
    if @customer_form.save
---
INSERT INTO "customers" ("email", "family_name", "given_name", "family_name_kana", "given_name_kana", "gender", "birthday", "hashed_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @customer_form = Staff::CustomerForm.new(Customer.find(params[:id]))
    @customer_form.assign_attributes(params[:form])
    if @customer_form.save
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "customers" SET "email" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["email", "test@example.jp"], ["updated_at", "2022-02-02 12:29:50.288718"], ["id", 4]]