apps/baukis2/app/controllers/staff/sessions_controller.rb

  def create
    @form = Staff::LoginForm.new(login_form_params)
    if @form.email.present?
      staff_member =
        StaffMember.find_by('LOWER(email) = ?', @form.email.downcase)
---
SELECT "staff_members".* FROM "staff_members" WHERE (LOWER(email) = 'member1@example.com') LIMIT $1  [["LIMIT", 1]]